graph = {}
graph[0] = {'на север': 0, 'на юг': 1, 'на восток': 0, 'на запад': 0, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[1] = {'на север': 4, 'на юг': 1, 'на восток': 1, 'на запад': 1, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[2] = {'на север': 8, 'на юг': 2, 'на восток': 2, 'на запад': 3, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[3] = {'на север': 3, 'на юг': 3, 'на восток': 3, 'на запад': 3, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[4] = {'на север': 6, 'на юг': 1, 'на восток': 5, 'на запад': 4, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 1, 'на запад': 0}, 'spec': 1}

graph[5] = {'на север': 0, 'на юг': 5, 'на восток': 5, 'на запад': 4, 'lock': {'на север': 1, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 1}

graph[6] = {'на север': 7, 'на юг': 4, 'на восток': 6, 'на запад': 8, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[7] = {'на север': 7, 'на юг': 6, 'на восток': 7, 'на запад': 7, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[8] = {'на север': 8, 'на юг': 2, 'на восток': 6, 'на запад': 9, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

graph[9] = {'на север': 9, 'на юг': 3, 'на восток': 8, 'на запад': 9, 'lock': {'на север': 0, 'на юг': 0, 'на восток': 0, 'на запад': 0}, 'spec': 0}

