text1 = '''Вы попали в бункер SGD-3345
Ваша цель : вынести из бункера радиоактивный объект. 
У вас есть компас. В первой комнате есть только дверь в северной стене. 
Желаем удачи!
(чтобы повторно увидеть описание комнаты напишите "описание")'''


text2 = '''Вы вошли в комнату. На полу лежит ключ-карта. Вы ее взяли . На стене висит записка: «Имя собаки: Кракен». 
В северной стене виден большой пролом. В западной стене красная дверь.'''


text3 = '''Вы входите в комнату и слышите хруст, на вас обрушивается потолок. Вы погибли. Квест перезапущен.'''


text4 = '''Вы вошли в комнату.  В южной стене комнаты металлическая темная дверь. В восточной стене современная дверь и рядом с ней терминал для ключ-карты.
В северной стене деревянная дверь.'''


text5 = '''Вы вошли в комнату.  В западной стене современная дверь. В северной стене дверь с экраном для ввода кода из 10 символов. Рядом с ним записка «Код: Месяц и год рождения, плюс алфавитный номер первой и второй буквы имени. (Без знаков препинания).»'''


text6 = '''Вы вошли в комнату. В комнате очень темно. В северной стене очертания серой двери . В южной стене деревянная дверь.  В западной стене поблескивает металлическая дверь.'''


text7 = '''Вы вошли в комнату. На полу лежит гаечный ключ. Вы его взяли.
С южной стороны серая дверь.'''


text8 = '''Вы вошли в комнату. В восточной  стене поблескивает металлическая дверь. В западной стене видна небольшая дверь.
В южной стене виден большой пролом, валяются кирпичи.'''


text9 = '''Вы вошли в комнату.  На стене висит записка: «Дата рождения 18.09.1999».
В восточной стене видна небольшая дверь.
В южной стене видна черная дверь.'''


text0 = '''Вы вошли в комнату. По середине комнаты к полу прикручен светящийся зеленый контейнер. 
В южной стене современная дверь.'''